-- MySQL dump 10.13  Distrib 5.7.17, for Win64 (x86_64)
--
-- Host: localhost    Database: tensor
-- ------------------------------------------------------
-- Server version	5.6.40

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `manage_stock`
--

DROP TABLE IF EXISTS `manage_stock`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `manage_stock` (
  `code` varchar(10) NOT NULL,
  `stockname` varchar(45) NOT NULL,
  `stocktype_typename` enum('의료정밀','종이목재','전기전자','화학','음식료품','섬유의복','기계','소형주','제조업','은행','중형주','종합','대형주','유통업','운수창고업','서비스업','의약품','증권','비금속광물','운수장비','건설업','금융업','철강금속','통신업','보험업','전기가스업') DEFAULT NULL,
  `start_date` date DEFAULT NULL,
  PRIMARY KEY (`stockname`,`code`),
  KEY `typename_idx` (`stocktype_typename`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `manage_stock`
--

LOCK TABLES `manage_stock` WRITE;
/*!40000 ALTER TABLE `manage_stock` DISABLE KEYS */;
INSERT INTO `manage_stock` VALUES ('A011150','CJ씨푸드','음식료품','2018-06-03'),('A011155','CJ씨푸드1우','음식료품','2018-06-03'),('A097950','CJ제일제당','음식료품','2018-06-03'),('A006360','GS건설','건설업','2018-06-01'),('A039570','HDC아이콘트','건설업','2018-06-01'),('A234080','JW생명과학','의약품','2018-06-02'),('A001060','JW중외제약','의약품','2018-06-02'),('A001067','JW중외제약2','의약품','2018-06-02'),('A001065','JW중외제약우','의약품','2018-06-02'),('A023150','MH에탄올','음식료품','2018-06-03'),('A005610','SPC삼립','음식료품','2018-06-03'),('A214390','경보제약','의약품','2018-06-02'),('A013580','계룡건설','건설업','2018-06-01'),('A004200','고려개발','건설업','2018-06-01'),('A002140','고려산업','음식료품','2018-06-03'),('A009290','광동제약','의약품','2018-06-02'),('A002720','국제약품','의약품','2018-06-02'),('A002990','금호산업','건설업','2018-06-01'),('A002995','금호산업우','건설업','2018-06-01'),('A013700','까뮤이앤씨','건설업','2018-06-01'),('A001260','남광토건','건설업','2018-06-01'),('A003920','남양유업','음식료품','2018-06-03'),('A003925','남양유업우','음식료품','2018-06-03'),('A006280','녹십자','의약품','2018-06-02'),('A004370','농심','음식료품','2018-06-03'),('A000210','대림산업','건설업','2018-06-01'),('A000215','대림산업우','건설업','2018-06-01'),('A001680','대상','음식료품','2018-06-03'),('A001685','대상우','음식료품','2018-06-03'),('A047040','대우건설','건설업','2018-06-01'),('A069620','대웅제약','의약품','2018-06-02'),('A003220','대원제약','의약품','2018-06-02'),('A001790','대한제당','음식료품','2018-06-03'),('A001799','대한제당3우B','음식료품','2018-06-03'),('A001795','대한제당우','음식료품','2018-06-03'),('A001130','대한제분','음식료품','2018-06-03'),('A005960','동부건설','건설업','2018-06-01'),('A005965','동부건설우','건설업','2018-06-01'),('A002210','동성제약','의약품','2018-06-02'),('A170900','동아에스티','의약품','2018-06-02'),('A028100','동아지질','건설업','2018-06-01'),('A049770','동원F&B','음식료품','2018-06-03'),('A011160','두산건설','건설업','2018-06-01'),('A280360','롯데제과','음식료품','2018-06-03'),('A005300','롯데칠성','음식료품','2018-06-03'),('A005305','롯데칠성우','음식료품','2018-06-03'),('A002270','롯데푸드','음식료품','2018-06-03'),('A027740','마니커','음식료품','2018-06-03'),('A033920','무학','음식료품','2018-06-03'),('A002410','범양건영','건설업','2018-06-01'),('A003850','보령제약','의약품','2018-06-02'),('A000890','보해양조','음식료품','2018-06-03'),('A003000','부광약품','의약품','2018-06-02'),('A005180','빙그레','음식료품','2018-06-03'),('A003960','사조대림','음식료품','2018-06-03'),('A008040','사조동아원','음식료품','2018-06-03'),('A014710','사조씨푸드','음식료품','2018-06-03'),('A006090','사조오양','음식료품','2018-06-03'),('A079660','사조해표','음식료품','2018-06-03'),('A001470','삼부토건','건설업','2018-06-01'),('A207940','삼성바이오로직스','의약품','2018-06-02'),('A001360','삼성제약','의약품','2018-06-02'),('A145990','삼양사','음식료품','2018-06-03'),('A145995','삼양사우','음식료품','2018-06-03'),('A003230','삼양식품','음식료품','2018-06-03'),('A000520','삼일제약','의약품','2018-06-02'),('A005500','삼진제약','의약품','2018-06-02'),('A001880','삼호','건설업','2018-06-01'),('A010960','삼호개발','건설업','2018-06-01'),('A248170','샘표식품','음식료품','2018-06-03'),('A004410','서울식품','음식료품','2018-06-03'),('A004415','서울식품우','음식료품','2018-06-03'),('A136490','선진','음식료품','2018-06-03'),('A005980','성지건설','건설업','2018-06-01'),('A068270','셀트리온','의약품','2018-06-01'),('A034300','신세계건설	','건설업','2018-06-01'),('A019170','신풍제약','의약품','2018-06-02'),('A019175','신풍제약우','의약품','2018-06-02'),('A005450','신한','건설업','2018-06-01'),('A002250','알보젠코리아','의약품','2018-06-02'),('A023960','에쓰씨엔지니어','건설업','2018-06-01'),('A003060','에이프로젠제약','의약품','2018-06-02'),('A007310','오뚜기','음식료품','2018-06-03'),('A002630','오리엔트바이오','의약품','2018-06-02'),('A271560','오리온','음식료품','2018-06-03'),('A006980','우성사료','음식료품','2018-06-03'),('A000220','유유제약','의약품','2018-06-02'),('A000225','유유제약1우','의약품','2018-06-02'),('A000227','유유제약2우B','의약품','2018-06-02'),('A000100','유한양행','의약품','2018-06-02'),('A102460','이연제약','의약품','2018-06-02'),('A249420','일동제약','의약품','2018-06-02'),('A013360','일성건설','건설업','2018-06-01'),('A003120','일성신약','의약품','2018-06-02'),('A007570','일양약품','의약품','2018-06-02'),('A007575','일양약품우','의약품','2018-06-02'),('A271980','제일약품','의약품','2018-06-02'),('A002600','조흥','음식료품','2018-06-03'),('A185750','종근당','의약품','2018-06-02'),('A063160','종근당바이오','의약품','2018-06-02'),('A011000','진원생명과학','의약품','2018-06-02'),('A002780','진흥기업','건설업','2018-06-01'),('A002787','진흥기업2우B','건설업','2018-06-01'),('A002785','진흥기업우B','건설업','2018-06-01'),('A003070','코오롱글로벌','건설업','2018-06-01'),('A003075','코오롱글로벌우','건설업','2018-06-01'),('A264900','크라운제과','음식료품','2018-06-03'),('A26490K','크라운제과우','음식료품','2018-06-03'),('A009410','태영건설','건설업','2018-06-01'),('A009415','태영건설우','건설업','2018-06-01'),('A005690','파미셀','의약품','2018-06-02'),('A036580','팜스코','음식료품','2018-06-03'),('A000080','하이트진로','음식료품','2018-06-03'),('A000087','하이트진로2우B','음식료품','2018-06-03'),('A014790','한라','건설업','2018-06-01'),('A128940','한미약품','의약품','2018-06-02'),('A003680','한성기업','음식료품','2018-06-03'),('A004960','한신공영','건설업','2018-06-01'),('A051600','한전KPS','건설업','2018-06-01'),('A097230','한진중공업','건설업','2018-06-01'),('A101530','해태제과식품','음식료품','2018-06-03'),('A000720','현대건설','건설업','2018-06-01'),('A000725','현대건설우','건설업','2018-06-01'),('A012630','현대산업','건설업','2018-06-01'),('A002460','화성산업','건설업','2018-06-01'),('A016580','환인제약','의약품','2018-06-02');
/*!40000 ALTER TABLE `manage_stock` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2018-06-08 19:36:24
